Revit 2024 API
BuiltInFailures.TrussFailures.TrussIsAttachedTo Property
 Revit cannot attach to the chosen Roof/Slab. The truss cannot project to a surface or the attachment creates an invalid profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TrussIsAttachedTo { get; }
Visual Basic
Public Shared ReadOnly Property TrussIsAttachedTo As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TrussIsAttachedTo {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace